import type { Notice } from './-temp-server-types';

export const mockNotices: Notice[] = [
  {
    id: 1,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
    isPinned: true,
  },
  {
    id: 2,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 3,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 4,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 5,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 6,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 7,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 8,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 9,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
  {
    id: 10,
    title: '경기 장소 및 시간 변경 안내',
    content:
      '안녕하세요. 팀원 여러분께 안내드립니다. 당초 예정되어 있던 이번 주 경기의 장소와 시간이 다음과 같이 변경되었습니다.',
    author: '홍명보',
    createdAt: '2025-04-23',
  },
];
